import React from "react";
import { Text, StyleSheet } from "react-native";
import { useNavigation } from "@react-navigation/native";

const about = () => {
  const navigation = useNavigation();
  return (
    <Text style={styles.baseText}>
      בס"ד אודות המערכת: כיום קיימים לא מעט אנשים ששוכרים דירה יחד עם שותפים,
      תהליך זה קורה בעיקר אצל רווקים עקב הגעה לגיל מסוים שאינם רוצים לגור עם
      ההורים או שרוצים לגור בסמיכות למקום העבודה או הלימודים. על מנת למצוא
      שותפים מתאימים יש צורך לחפש בפלטפורמות מתאימות ולהגדיר לעצמך מראש איזה
      סגנון שותף בדיוק מחפשים כגון שומר שבת, לא מעשן וכדומה... חלק מהפלטפורמות
      הקיימות אינן נוחות לחיפוש (למשל קבוצות פייסבוק) ובעקבות כך קיים מספר לא
      מועט באוכלוסייה של מחפשי דירה שמתגוררים בדירת שותפים אך יש להם אי שביעות
      רצון מהשותף בדירה או גרוע מכך בחלק מהאוכלוסייה מוותרים "מראש" על הזדמנות
      זו להיכנס לדירת שותפים כדי לא להגיע למצב של אי נעימות עם השותף. אפליקציה
      זאת room-8 פותחה בשנת 2022 ע"י שני סטודנטים ממכללת סמי שמעון: אבירם כהן
      ומתן עמר. האפליקציה מסייעת לכלל האוכלוסייה המעוניינת לגור בדירה עם שותף
      אחד או יותר על פי קריטריונים מראש שהמחפש מעוניין כגון מכניס בעלי חיים
      לדירה, שמירת שבת בדירה וכדומה.. ביישומון קיימים שלושה סוגי משתמשים: מנהל
      היישומון ,משתמש רשום ואורח. משתמש רשום יכול לבצע התחברות, צפייה במאגר
      הדירות הקיים ביישומון, חיפוש דירות על פי סינון ,פרסום דירה ועוד... אורח
      (משתמש שאינו רשום ליישומון) יכול להירשם, לצפות בדירות הקיימות במאגר ולסנן
      אותן בחיפוש אך אינו יכול לפרסם דירה בעצמו (על מנת לפרסם הוא יצטרך להירשם
      ליישומון) מנהל האפליקציה יכול בעצם לשלוט על הנתונים הקיימים באפליקציה:
      צפייה בכל המשתמשים ופרטיהם, צפייה בכל מאגר הדירות, מחיקת דירות לא
      רלוונטיות ועוד... האפליקציה מספקת ממשק נוח וידידותי למשתמש, מיועדת למערכת
      הפעלה iOS ו Android ופותחה ב React-Native בסביבת עבודה Visual Studio Code
      בשפת JavaScript ובבסיס הנתונים firebase להצעות ייעול יש לפנות למפתחי
      האפליקציה במייל:
      <Text style={styles.innerText}>
        {" "}
        אבירם כהן- aviramcohen46@gmail.com מתן עמר- matan4749@gmail.com ©כל
        הזכויות שמורות-2022
      </Text>
    </Text>
  );
};

const styles = StyleSheet.create({
  baseText: {
    fontWeight: "bold",
  },
  innerText: {
    color: "red",
  },
});

export default about;
